perf/baseline.yaml
before:
  flow:
    - put:
        url: '/accounts/1/balance'
        json: { balance: 1000000000000000 }
    - put:
        url: '/accounts/2/balance'
        json: { balance: 1000000000000000 }
    - put:
        url: '/accounts/3/balance'
        json: { balance: 1000000000000000 }
    - put:
        url: '/accounts/4/balance'
        json: { balance: 1000000000000000 }

config:
  plugins:
    metrics-by-endpoint: {}

  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 1000

  http:
    timeout: 10

  phases:
    - name: Plain
      duration: 240
      arrivalRate: 40

scenarios:
  - name: exchange
    weight: 60
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'ARS'
            counterCurrency: 'USD'
            baseAccountId: 'cli-ARS'
            counterAccountId: 'cli-USD'
            baseAmount: 100000

  - name: log
    weight: 25
    flow:
      - get:
          url: '/log'

  - name: rates
    weight: 15
    flow:
      - get:
          url: '/rates'